<template>
  <div class="main-box">
    <div class="title-box">水利知识库</div>
    <div class="search-area-box">
      <div class="search-box">
      <span class="icon-fire">
<svg t="1667350078127" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="5672"
     width="16" height="16"><path
    d="M486.2 102.6s11-11.2 27.5 3c25.3 21.8 211.6 197.8 289.2 331.1 57.9 99.4 61.9 218.5 22.6 302.4-42.5 90.7-91 129-135.7 150.2-49.4 23.4-83.4 37.3-212.4 38.9-13.6 0.2-17.7-797.5-17.7-797.5l26.5-28.1z"
    fill="#2280BF" p-id="5673"></path><path
    d="M486.2 928.3c-174.8 0-316.5-142.8-316.5-319 0-117.5 105.5-286.4 316.5-506.7 211 220.3 316.5 389.2 316.5 506.7 0.1 176.1-141.7 319-316.5 319zM254.3 653.4c21.2 89 85.8 161.3 171.8 192.5 7 2.5 14.7 2.1 21.4-1.1 6.7-3.2 11.8-8.9 14.3-16 5.2-14.6-2.4-30.7-16.9-36-68.2-24.7-119.4-82.1-136.2-152.6-2.4-9.7-9.7-17.4-19.3-20.2-9.6-2.8-19.9-0.3-27.2 6.6-7.3 6.9-10.3 17.1-7.9 26.8z m0 0"
    fill="#4EB3FF" p-id="5674"></path></svg>
      </span>
        <input class="input-box" v-model="searchKey"/>
        <button class="search-button-box" @click="search()">
          <span class="icon-search">
          <svg class="icon" viewBox="0 0 1024 1024" xmlns="http://www.w3.org/2000/svg"
               width="24" height="24">
            <path
                d="M862.609 816.955L726.44 680.785l-0.059-0.056a358.907 358.907 0 0 0 56.43-91.927c18.824-44.507 28.369-91.767 28.369-140.467 0-48.701-9.545-95.96-28.369-140.467-18.176-42.973-44.19-81.56-77.319-114.689-33.13-33.129-71.717-59.144-114.69-77.32-44.507-18.825-91.767-28.37-140.467-28.37-48.701 0-95.96 9.545-140.467 28.37-42.973 18.176-81.56 44.19-114.689 77.32-33.13 33.129-59.144 71.717-77.32 114.689-18.825 44.507-28.37 91.767-28.37 140.467 0 48.7 9.545 95.96 28.37 140.467 18.176 42.974 44.19 81.561 77.32 114.69 33.129 33.129 71.717 59.144 114.689 77.319 44.507 18.824 91.767 28.369 140.467 28.369 48.7 0 95.96-9.545 140.467-28.369 32.78-13.864 62.997-32.303 90.197-54.968 0.063 0.064 0.122 0.132 0.186 0.195l136.169 136.17c6.25 6.25 14.438 9.373 22.628 9.373 8.188 0 16.38-3.125 22.627-9.372 12.496-12.496 12.496-32.758 0-45.254z m-412.274-69.466c-79.907 0-155.031-31.118-211.534-87.62-56.503-56.503-87.62-131.627-87.62-211.534s31.117-155.031 87.62-211.534c56.502-56.503 131.626-87.62 211.534-87.62s155.031 31.117 211.534 87.62c56.502 56.502 87.62 131.626 87.62 211.534s-31.118 155.031-87.62 211.534c-56.503 56.502-131.627 87.62-211.534 87.62z"
                fill="#ffffff"></path>
          </svg>
            </span>
          <span>搜索</span>
        </button>
      </div>
    </div>

    <div class="graph-area">
      <div id="mountNode" class="graph-box"></div>
    </div>
  </div>
</template>

<script>
import G6 from "@antv/g6";

export default {
  label: "GraphView",

  methods: {
    data() {
      return {
        searchKey: "",
        currentGraph: null
      }
    },
    async search() {
      let result = await this.$http.get("/query/" + this.searchKey)
      // console.log(result.data.data)
      let nodeList = []
      let edgeList = []
      let dataList = result.data.data

      for (let data of dataList) {
        nodeList.push(...data.Nodes)
        edgeList.push(...data.Relationships)
      }
      let g6NodeList = []
      let nodeIdList = []

      const colors = [
        '#BDD2FD',
        '#BDEFDB',
        '#C2C8D5',
        '#FBE5A2',
        '#F6C3B7',
        '#B6E3F5',
        '#D3C6EA',
        '#FFD8B8',
        '#AAD8D8',
        '#FFD6E7',
      ];
      const strokes = [
        '#5B8FF9',
        '#5AD8A6',
        '#5D7092',
        '#F6BD16',
        '#E8684A',
        '#6DC8EC',
        '#9270CA',
        '#FF9D4D',
        '#269A99',
        '#FF99C3',
      ];

      for (let node of nodeList) {
        let newNode = {}
        newNode['cluster'] = node['Labels'][0]
        newNode['label'] = node['Props']["name"]
        newNode['id'] = node['ElementId']
        if (nodeIdList.indexOf(newNode['id']) == -1) {
          g6NodeList.push(newNode)
          nodeIdList.push(newNode['id'])
        }
        console.log(node)
      }
      let g6EdgeList = []
      for (let edge of edgeList) {
        let newEdge = {}
        newEdge['source'] = edge['StartElementId']
        newEdge['target'] = edge['EndElementId']
        newEdge['label'] = edge['Type']
        g6EdgeList.push(newEdge)
      }
      console.log("nodeList");
      console.log(g6NodeList);
      console.log("edgeList");
      console.log(g6EdgeList);



      const data1 = {
        nodes: g6NodeList,
        edges: g6EdgeList
      }
      const data = {
        // 点集
        nodes: [
          {
            "id": "9953",
            "labels": [
              "市"
            ],
            "properties": {
              "城市名称": "乐山市",
              "城市id": "5cd13baf89730d27e4f639c6",
              "城市代码": "511100000000"
            },
            "label": "乐山市"
          },
          {
            "id": "941293",
            "labels": [
              "水利术语"
            ],
            "properties": {
              "名称": "乐山市",
              "释义": "乐山，古称嘉州，四川省辖地级市，介于东经102°15′～104°15′、北纬28°28′～29°56′之间，乐山位于四川盆地西南部，坐落在岷江、青衣江、大渡河三江交汇处，北与眉山接壤，东与自贡、宜宾毗邻，南与凉山相接，西与雅安连界，中心城区距成都双流国际机场仅100公里。成都平原南部中心城市。 乐山是四川粮食、副食品、清洁能源、新材料和建材生产基地，国家质检总局批准的国家硅材料及副产物产品质量监督检验中心。 历史上属古蜀国，有“海棠香国”的美誉。乐山市是国家历史文化名城、国家首批对外开放城市、全国绿化模范城市、中国优秀旅游城市、国家园林城市、全国卫生城市、2008北京奥运会火炬传递城市之一。乐山市是中国唯一一个拥有三处不同类型世界遗产的城市（乐山大佛景区、峨眉山景区、东风堰），乐山将从国际旅游目的地、中国国际佛教文化旅游目的地、国家级旅游度假区、全省旅游商品集散地四个方面着力，奋力做好提质扩容、景城一体、全域旅游三篇文章，努力开创乐山旅游发展新篇章。 2017年入选第四届四川省文明城市。 ",
              "编号": "SUB000142298"
            },
            "label": "乐山市"
          },
          {
            "id": "9953",
            "labels": [
              "市"
            ],
            "properties": {
              "城市名称": "乐山市",
              "城市id": "5cd13baf89730d27e4f639c6",
              "城市代码": "511100000000"
            },
            "label": "乐山市"
          },
          {
            "id": "941293",
            "labels": [
              "水利术语"
            ],
            "properties": {
              "名称": "乐山市",
              "释义": "乐山，古称嘉州，四川省辖地级市，介于东经102°15′～104°15′、北纬28°28′～29°56′之间，乐山位于四川盆地西南部，坐落在岷江、青衣江、大渡河三江交汇处，北与眉山接壤，东与自贡、宜宾毗邻，南与凉山相接，西与雅安连界，中心城区距成都双流国际机场仅100公里。成都平原南部中心城市。 乐山是四川粮食、副食品、清洁能源、新材料和建材生产基地，国家质检总局批准的国家硅材料及副产物产品质量监督检验中心。 历史上属古蜀国，有“海棠香国”的美誉。乐山市是国家历史文化名城、国家首批对外开放城市、全国绿化模范城市、中国优秀旅游城市、国家园林城市、全国卫生城市、2008北京奥运会火炬传递城市之一。乐山市是中国唯一一个拥有三处不同类型世界遗产的城市（乐山大佛景区、峨眉山景区、东风堰），乐山将从国际旅游目的地、中国国际佛教文化旅游目的地、国家级旅游度假区、全省旅游商品集散地四个方面着力，奋力做好提质扩容、景城一体、全域旅游三篇文章，努力开创乐山旅游发展新篇章。 2017年入选第四届四川省文明城市。 ",
              "编号": "SUB000142298"
            },
            "label": "乐山市"
          },
          {
            "id": "12515",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "峨眉山市",
              "区县代码": "511181000000",
              "区县id": "5cd1439489730d2d50fe5a8d"
            },
            "label": "峨眉山市"
          },
          {
            "id": "12506",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "沙湾区",
              "区县代码": "511111000000",
              "区县id": "5cd1439489730d2d50fe5a84"
            },
            "label": "沙湾区"
          },
          {
            "id": "12510",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "井研县",
              "区县代码": "511124000000",
              "区县id": "5cd1439489730d2d50fe5a88"
            },
            "label": "井研县"
          },
          {
            "id": "12507",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "五通桥区",
              "区县代码": "511112000000",
              "区县id": "5cd1439489730d2d50fe5a85"
            },
            "label": "五通桥区"
          },
          {
            "id": "12505",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "市中区",
              "区县代码": "511102000000",
              "区县id": "5cd1439489730d2d50fe5a83"
            },
            "label": "市中区"
          },
          {
            "id": "12514",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "马边彝族自治县",
              "区县代码": "511133000000",
              "区县id": "5cd1439489730d2d50fe5a8c"
            },
            "label": "马边彝族自治县"
          },
          {
            "id": "12508",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "金口河区",
              "区县代码": "511113000000",
              "区县id": "5cd1439489730d2d50fe5a86"
            },
            "label": "金口河区"
          },
          {
            "id": "12504",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "市辖区",
              "区县代码": "511101000000",
              "区县id": "5cd1439489730d2d50fe5a82"
            },
            "label": "市辖区"
          },
          {
            "id": "12513",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "峨边彝族自治县",
              "区县代码": "511132000000",
              "区县id": "5cd1439489730d2d50fe5a8b"
            },
            "label": "峨边彝族自治县"
          },
          {
            "id": "12512",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "沐川县",
              "区县代码": "511129000000",
              "区县id": "5cd1439489730d2d50fe5a8a"
            },
            "label": "沐川县"
          },
          {
            "id": "12511",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "夹江县",
              "区县代码": "511126000000",
              "区县id": "5cd1439489730d2d50fe5a89"
            },
            "label": "夹江县"
          },
          {
            "id": "12509",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "犍为县",
              "区县代码": "511123000000",
              "区县id": "5cd1439489730d2d50fe5a87"
            },
            "label": "犍为县"
          },
          {
            "id": "9703",
            "labels": [
              "省"
            ],
            "properties": {
              "省份代码": "51",
              "省份名称": "四川省",
              "省份id": "5cd13b4189730d12d4abdc72"
            },
            "label": "四川省"
          },
          {
            "id": "987424",
            "labels": [
              "人员"
            ],
            "properties": {
              "姓名": "杨译舒",
              "研究领域": "暴雨强度公式,皮尔逊-Ⅲ型分布曲线,耿贝尔分布曲线,指数分布曲线,暴雨参数,四川乐山市",
              "人员id": "R14200"
            },
            "label": "杨译舒"
          },
          {
            "id": "1384348",
            "labels": [
              "文献"
            ],
            "properties": {
              "文献作者": "杨良清",
              "文献类型": "论文",
              "文献摘要": "加快发展水利,着力改善民生,对进一步增强经济社会发展的基础保障能力意义十分重大。作为地处\"三江\"流域的乐山市,存在水资源分布不均、渠系配套较低、骨干水利工程不足、农村人口饮水不安全等困难和问题,成为制约全市水利发展的\"瓶颈\"。必须坚持科学发展观,加快水利工程建设,加大对水利的投入力度,推进依法治水和科技兴水,强化水利管理和改革,进一步优化政策环境,加强对水利工作的领导,才能促进传统水利向现代水利的转变,实现构建和谐水利的目标。",
              "发表期刊": "四川水利",
              "文献id": "P233457",
              "发表日期": "2008年05期",
              "文献名称": "乐山市发展水利改善民生的策略",
              "文献关键词": "发展水利,改善民生,策略,乐山市"
            },
            "label": "乐山市发展水利改善民生的策略"
          },
          {
            "id": "1124638",
            "labels": [
              "文献"
            ],
            "properties": {
              "文献作者": "杨译舒,叶兴成,王飞,朱程亮,游志康,欧淑芳,刘俊",
              "文献类型": "论文",
              "文献摘要": "利用四川省乐山市气象站1981-2015年短历时暴雨雨量资料,采用年最大值法选样推求暴雨公式,分析皮尔逊-Ⅲ型分布曲线、耿贝尔分布曲线、指数分布曲线三种频率分布曲线模型与原始暴雨资料的适配性,并对不同频率分布的暴雨参数进行分析。结果表明三种频率分布曲线导出的暴雨公式在计算重现期为2-20年时,仅耿贝尔分布曲线符合精度要求。将新编的暴雨公式与现行暴雨公式、周边城市暴雨公式及《中国暴雨统计参数图集》进行了对比分析,新一代乐山市暴雨公式参数合理性得以验证,为乐山市排水系统的优化设计、排水管网建设与改造提供了新的理论参考。",
              "发表期刊": "灾害学",
              "文献id": "P19291",
              "发表日期": "2017年04期",
              "文献名称": "基于不同频率分布的乐山市暴雨参数分析",
              "文献关键词": "暴雨强度公式,皮尔逊-Ⅲ型分布曲线,耿贝尔分布曲线,指数分布曲线,暴雨参数,四川乐山市"
            },
            "label": "基于不同频率分布的乐山市暴雨参数分析"
          },
          {
            "id": "66673",
            "labels": [
              "水利术语"
            ],
            "properties": {
              "名称拼音": "shuǐ lì gōng chéng",
              "英文名称": "",
              "是否为正式主题词": "1.0",
              "术语来源": "互动百科",
              "名称": "水利工程",
              "术语释义": "水利工程是用于控制和调配自然界的地表水和地下水，达到除害兴利目的而修建的工程。也称为水工程。水是人类生产和生活必不可少的宝贵资源，但其自然存在的状态并不完全符合人类的需要。只有修建水利工程，才能控制水流，防止洪涝灾害，并进行水量的调节和分配，以满足人民生活和生产对水资源的需要。水利工程需要修建坝、堤、溢洪道、水闸、进水口、渠道、渡漕、筏道、鱼道等不同类型的水工建筑物，以实现其目标。",
              "释义": "水利工程是用于控制和调配自然界的地表水和地下水，达到除害兴利目的而修建的工程。也称为水工程。水是人类生产和生活必不可少的宝贵资源，但其自然存在的状态并不完全符合人类的需要。只有修建水利工程，才能控制水流，防止洪涝灾害，并进行水量的调节和分配，以满足人民生活和生产对水资源的需要。水利工程需要修建坝、堤、溢洪道、水闸、进水口、渠道、渡漕、筏道、鱼道等不同类型的水工建筑物，以实现其目标。",
              "编号": "110000012",
              "名称拼音首字母": "SLGC"
            },
            "label": "水利工程"
          },
          {
            "id": "901317",
            "labels": [
              "水利术语"
            ],
            "properties": {
              "名称": "农村水利",
              "编号": "SUB000017352"
            },
            "label": "农村水利"
          },
          {
            "id": "12515",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "峨眉山市",
              "区县代码": "511181000000",
              "区县id": "5cd1439489730d2d50fe5a8d"
            },
            "label": "峨眉山市"
          },
          {
            "id": "12506",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "沙湾区",
              "区县代码": "511111000000",
              "区县id": "5cd1439489730d2d50fe5a84"
            },
            "label": "沙湾区"
          },
          {
            "id": "12510",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "井研县",
              "区县代码": "511124000000",
              "区县id": "5cd1439489730d2d50fe5a88"
            },
            "label": "井研县"
          },
          {
            "id": "12507",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "五通桥区",
              "区县代码": "511112000000",
              "区县id": "5cd1439489730d2d50fe5a85"
            },
            "label": "五通桥区"
          },
          {
            "id": "12505",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "市中区",
              "区县代码": "511102000000",
              "区县id": "5cd1439489730d2d50fe5a83"
            },
            "label": "市中区"
          },
          {
            "id": "12514",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "马边彝族自治县",
              "区县代码": "511133000000",
              "区县id": "5cd1439489730d2d50fe5a8c"
            },
            "label": "马边彝族自治县"
          },
          {
            "id": "12508",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "金口河区",
              "区县代码": "511113000000",
              "区县id": "5cd1439489730d2d50fe5a86"
            },
            "label": "金口河区"
          },
          {
            "id": "12504",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "市辖区",
              "区县代码": "511101000000",
              "区县id": "5cd1439489730d2d50fe5a82"
            },
            "label": "市辖区"
          },
          {
            "id": "12513",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "峨边彝族自治县",
              "区县代码": "511132000000",
              "区县id": "5cd1439489730d2d50fe5a8b"
            },
            "label": "峨边彝族自治县"
          },
          {
            "id": "12512",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "沐川县",
              "区县代码": "511129000000",
              "区县id": "5cd1439489730d2d50fe5a8a"
            },
            "label": "沐川县"
          },
          {
            "id": "12511",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "夹江县",
              "区县代码": "511126000000",
              "区县id": "5cd1439489730d2d50fe5a89"
            },
            "label": "夹江县"
          },
          {
            "id": "12509",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "犍为县",
              "区县代码": "511123000000",
              "区县id": "5cd1439489730d2d50fe5a87"
            },
            "label": "犍为县"
          },
          {
            "id": "9703",
            "labels": [
              "省"
            ],
            "properties": {
              "省份代码": "51",
              "省份名称": "四川省",
              "省份id": "5cd13b4189730d12d4abdc72"
            },
            "label": "四川省"
          },
          {
            "id": "987424",
            "labels": [
              "人员"
            ],
            "properties": {
              "姓名": "杨译舒",
              "研究领域": "暴雨强度公式,皮尔逊-Ⅲ型分布曲线,耿贝尔分布曲线,指数分布曲线,暴雨参数,四川乐山市",
              "人员id": "R14200"
            },
            "label": "杨译舒"
          },
          {
            "id": "1384348",
            "labels": [
              "文献"
            ],
            "properties": {
              "文献作者": "杨良清",
              "文献类型": "论文",
              "文献摘要": "加快发展水利,着力改善民生,对进一步增强经济社会发展的基础保障能力意义十分重大。作为地处\"三江\"流域的乐山市,存在水资源分布不均、渠系配套较低、骨干水利工程不足、农村人口饮水不安全等困难和问题,成为制约全市水利发展的\"瓶颈\"。必须坚持科学发展观,加快水利工程建设,加大对水利的投入力度,推进依法治水和科技兴水,强化水利管理和改革,进一步优化政策环境,加强对水利工作的领导,才能促进传统水利向现代水利的转变,实现构建和谐水利的目标。",
              "发表期刊": "四川水利",
              "文献id": "P233457",
              "发表日期": "2008年05期",
              "文献名称": "乐山市发展水利改善民生的策略",
              "文献关键词": "发展水利,改善民生,策略,乐山市"
            },
            "label": "乐山市发展水利改善民生的策略"
          },
          {
            "id": "1124638",
            "labels": [
              "文献"
            ],
            "properties": {
              "文献作者": "杨译舒,叶兴成,王飞,朱程亮,游志康,欧淑芳,刘俊",
              "文献类型": "论文",
              "文献摘要": "利用四川省乐山市气象站1981-2015年短历时暴雨雨量资料,采用年最大值法选样推求暴雨公式,分析皮尔逊-Ⅲ型分布曲线、耿贝尔分布曲线、指数分布曲线三种频率分布曲线模型与原始暴雨资料的适配性,并对不同频率分布的暴雨参数进行分析。结果表明三种频率分布曲线导出的暴雨公式在计算重现期为2-20年时,仅耿贝尔分布曲线符合精度要求。将新编的暴雨公式与现行暴雨公式、周边城市暴雨公式及《中国暴雨统计参数图集》进行了对比分析,新一代乐山市暴雨公式参数合理性得以验证,为乐山市排水系统的优化设计、排水管网建设与改造提供了新的理论参考。",
              "发表期刊": "灾害学",
              "文献id": "P19291",
              "发表日期": "2017年04期",
              "文献名称": "基于不同频率分布的乐山市暴雨参数分析",
              "文献关键词": "暴雨强度公式,皮尔逊-Ⅲ型分布曲线,耿贝尔分布曲线,指数分布曲线,暴雨参数,四川乐山市"
            },
            "label": "基于不同频率分布的乐山市暴雨参数分析"
          },
          {
            "id": "66673",
            "labels": [
              "水利术语"
            ],
            "properties": {
              "名称拼音": "shuǐ lì gōng chéng",
              "英文名称": "",
              "是否为正式主题词": "1.0",
              "术语来源": "互动百科",
              "名称": "水利工程",
              "术语释义": "水利工程是用于控制和调配自然界的地表水和地下水，达到除害兴利目的而修建的工程。也称为水工程。水是人类生产和生活必不可少的宝贵资源，但其自然存在的状态并不完全符合人类的需要。只有修建水利工程，才能控制水流，防止洪涝灾害，并进行水量的调节和分配，以满足人民生活和生产对水资源的需要。水利工程需要修建坝、堤、溢洪道、水闸、进水口、渠道、渡漕、筏道、鱼道等不同类型的水工建筑物，以实现其目标。",
              "释义": "水利工程是用于控制和调配自然界的地表水和地下水，达到除害兴利目的而修建的工程。也称为水工程。水是人类生产和生活必不可少的宝贵资源，但其自然存在的状态并不完全符合人类的需要。只有修建水利工程，才能控制水流，防止洪涝灾害，并进行水量的调节和分配，以满足人民生活和生产对水资源的需要。水利工程需要修建坝、堤、溢洪道、水闸、进水口、渠道、渡漕、筏道、鱼道等不同类型的水工建筑物，以实现其目标。",
              "编号": "110000012",
              "名称拼音首字母": "SLGC"
            },
            "label": "水利工程"
          },
          {
            "id": "901317",
            "labels": [
              "水利术语"
            ],
            "properties": {
              "名称": "农村水利",
              "编号": "SUB000017352"
            },
            "label": "农村水利"
          }
        ],
        // 边集
        edges: [
          {
            "id": "12434",
            "label": "隶属于",
            "source": "12515",
            "target": "9953"
          },
          {
            "id": "12425",
            "label": "隶属于",
            "source": "12506",
            "target": "9953"
          },
          {
            "id": "12429",
            "label": "隶属于",
            "source": "12510",
            "target": "9953"
          },
          {
            "id": "12426",
            "label": "隶属于",
            "source": "12507",
            "target": "9953"
          },
          {
            "id": "12424",
            "label": "隶属于",
            "source": "12505",
            "target": "9953"
          },
          {
            "id": "12433",
            "label": "隶属于",
            "source": "12514",
            "target": "9953"
          },
          {
            "id": "12427",
            "label": "隶属于",
            "source": "12508",
            "target": "9953"
          },
          {
            "id": "12423",
            "label": "隶属于",
            "source": "12504",
            "target": "9953"
          },
          {
            "id": "12432",
            "label": "隶属于",
            "source": "12513",
            "target": "9953"
          },
          {
            "id": "12431",
            "label": "隶属于",
            "source": "12512",
            "target": "9953"
          },
          {
            "id": "12430",
            "label": "隶属于",
            "source": "12511",
            "target": "9953"
          },
          {
            "id": "12428",
            "label": "隶属于",
            "source": "12509",
            "target": "9953"
          },
          {
            "id": "9867",
            "label": "隶属于",
            "source": "9953",
            "target": "9703"
          },
          {
            "id": "2955857",
            "label": "研究主题",
            "source": "987424",
            "target": "941293"
          },
          {
            "id": "2540856",
            "label": "研究主题",
            "source": "1384348",
            "target": "941293"
          },
          {
            "id": "1680348",
            "label": "研究主题",
            "source": "1124638",
            "target": "941293"
          },
          {
            "id": "1033317",
            "label": "所属类目",
            "source": "941293",
            "target": "66673"
          },
          {
            "id": "815958",
            "label": "所属类目",
            "source": "941293",
            "target": "901317"
          },
          {
            "id": "12434",
            "label": "隶属于",
            "source": "12515",
            "target": "9953"
          },
          {
            "id": "12425",
            "label": "隶属于",
            "source": "12506",
            "target": "9953"
          },
          {
            "id": "12429",
            "label": "隶属于",
            "source": "12510",
            "target": "9953"
          },
          {
            "id": "12426",
            "label": "隶属于",
            "source": "12507",
            "target": "9953"
          },
          {
            "id": "12424",
            "label": "隶属于",
            "source": "12505",
            "target": "9953"
          },
          {
            "id": "12433",
            "label": "隶属于",
            "source": "12514",
            "target": "9953"
          },
          {
            "id": "12427",
            "label": "隶属于",
            "source": "12508",
            "target": "9953"
          },
          {
            "id": "12423",
            "label": "隶属于",
            "source": "12504",
            "target": "9953"
          },
          {
            "id": "12432",
            "label": "隶属于",
            "source": "12513",
            "target": "9953"
          },
          {
            "id": "12431",
            "label": "隶属于",
            "source": "12512",
            "target": "9953"
          },
          {
            "id": "12430",
            "label": "隶属于",
            "source": "12511",
            "target": "9953"
          },
          {
            "id": "12428",
            "label": "隶属于",
            "source": "12509",
            "target": "9953"
          },
          {
            "id": "9867",
            "label": "隶属于",
            "source": "9953",
            "target": "9703"
          },
          {
            "id": "2955857",
            "label": "研究主题",
            "source": "987424",
            "target": "941293"
          },
          {
            "id": "2540856",
            "label": "研究主题",
            "source": "1384348",
            "target": "941293"
          },
          {
            "id": "1680348",
            "label": "研究主题",
            "source": "1124638",
            "target": "941293"
          },
          {
            "id": "1033317",
            "label": "所属类目",
            "source": "941293",
            "target": "66673"
          },
          {
            "id": "815958",
            "label": "所属类目",
            "source": "941293",
            "target": "901317"
          }
        ],
      };

      this.currentGraph.data(data1); // 读取 Step 2 中的数据源到图上
      this.currentGraph.render(); // 渲染图
      console.log(this.searchKey)
    },
    async initGraph() {

      let result = await this.$http.get("/ping")
      console.log(result.data.data)

      let nodeList = []
      let edgeList = []
      let dataList = result.data.data

      for (let data of dataList) {
        nodeList.push(...data.Nodes)
        edgeList.push(...data.Relationships)
      }

      let g6NodeList = []
      for (let node of nodeList) {
        let newNode = {}
        // console.log(node['Props']);
        newNode['cluster'] = node['Labels'][0]
        newNode['label'] = node['Props']["name"]
        newNode['id'] = node['ElementId']
        g6NodeList.push(newNode)
        // console.log(node)
      }
      let g6EdgeList = []
      for (let edge of edgeList) {
        let newEdge = {}
        // console.log(edge);
        // newEdge['id'] = edge['Id']
        newEdge['source'] = edge['StartElementId']
        newEdge['target'] = edge['EndElementId']
        newEdge['label'] = edge['Type']
        g6EdgeList.push(newEdge)
      }
      console.log("nodeList");
      console.log(g6NodeList);
      console.log("edgeList");
      console.log(g6EdgeList);

      const legendData = {
        nodes: [
          { id: '河流', label: 'a', },
          { id: '区县', label: 'b', },
          { id: 'c', label: 'c', },
          { id: 'd', label: 'd', }
        ], edges: [
          { id: 'a', label: 'a', },
          { id: 'b', label: 'b', },
          { id: 'c', label: 'c', },
          { id: 'd', label: 'd', }
        ]
      }

      const legend = new G6.Legend({
        data: legendData,
        align: 'center',
        layout: 'horizontal', // vertical
        position: 'bottom-left',
        vertiSep: 12,
        horiSep: 24,
        offsetY: -24,
        padding: [4, 16, 8, 16],
        containerStyle: {
          fill: '#ccc',
          lineWidth: 1
        },
        title: '图例',
        titleConfig: {
          position: 'left',
          offsetX: 0,
          offsetY: 12,
        },
        filter: {
          enable: true,
          multiple: true,
          trigger: 'click',
          graphActiveState: 'activeByLegend',
          graphInactiveState: 'inactiveByLegend',
          filterFunctions: {
            'a': (d) => {
              if (d.cluster === 'a') return true;
              return false
            },
            'b': (d) => {
              if (d.cluster === 'b') return true;
              return false
            },
            'c': (d) => {
              if (d.cluster === 'c') return true;
              return false
            },
            'd': (d) => {
              if (d.cluster === 'd') return true;
              return false
            },
          }
        }
      });

      const data1 = {
        nodes: g6NodeList,
        edges: g6EdgeList
      }
      const data = {
        // 点集
        nodes: [
          {
            "id": "9953",
            "labels": [
              "市"
            ],
            "properties": {
              "城市名称": "乐山市",
              "城市id": "5cd13baf89730d27e4f639c6",
              "城市代码": "511100000000"
            },
            "label": "乐山市"
          },
          {
            "id": "941293",
            "labels": [
              "水利术语"
            ],
            "properties": {
              "名称": "乐山市",
              "释义": "乐山，古称嘉州，四川省辖地级市，介于东经102°15′～104°15′、北纬28°28′～29°56′之间，乐山位于四川盆地西南部，坐落在岷江、青衣江、大渡河三江交汇处，北与眉山接壤，东与自贡、宜宾毗邻，南与凉山相接，西与雅安连界，中心城区距成都双流国际机场仅100公里。成都平原南部中心城市。 乐山是四川粮食、副食品、清洁能源、新材料和建材生产基地，国家质检总局批准的国家硅材料及副产物产品质量监督检验中心。 历史上属古蜀国，有“海棠香国”的美誉。乐山市是国家历史文化名城、国家首批对外开放城市、全国绿化模范城市、中国优秀旅游城市、国家园林城市、全国卫生城市、2008北京奥运会火炬传递城市之一。乐山市是中国唯一一个拥有三处不同类型世界遗产的城市（乐山大佛景区、峨眉山景区、东风堰），乐山将从国际旅游目的地、中国国际佛教文化旅游目的地、国家级旅游度假区、全省旅游商品集散地四个方面着力，奋力做好提质扩容、景城一体、全域旅游三篇文章，努力开创乐山旅游发展新篇章。 2017年入选第四届四川省文明城市。 ",
              "编号": "SUB000142298"
            },
            "label": "乐山市"
          },
          {
            "id": "9953",
            "labels": [
              "市"
            ],
            "properties": {
              "城市名称": "乐山市",
              "城市id": "5cd13baf89730d27e4f639c6",
              "城市代码": "511100000000"
            },
            "label": "乐山市"
          },
          {
            "id": "941293",
            "labels": [
              "水利术语"
            ],
            "properties": {
              "名称": "乐山市",
              "释义": "乐山，古称嘉州，四川省辖地级市，介于东经102°15′～104°15′、北纬28°28′～29°56′之间，乐山位于四川盆地西南部，坐落在岷江、青衣江、大渡河三江交汇处，北与眉山接壤，东与自贡、宜宾毗邻，南与凉山相接，西与雅安连界，中心城区距成都双流国际机场仅100公里。成都平原南部中心城市。 乐山是四川粮食、副食品、清洁能源、新材料和建材生产基地，国家质检总局批准的国家硅材料及副产物产品质量监督检验中心。 历史上属古蜀国，有“海棠香国”的美誉。乐山市是国家历史文化名城、国家首批对外开放城市、全国绿化模范城市、中国优秀旅游城市、国家园林城市、全国卫生城市、2008北京奥运会火炬传递城市之一。乐山市是中国唯一一个拥有三处不同类型世界遗产的城市（乐山大佛景区、峨眉山景区、东风堰），乐山将从国际旅游目的地、中国国际佛教文化旅游目的地、国家级旅游度假区、全省旅游商品集散地四个方面着力，奋力做好提质扩容、景城一体、全域旅游三篇文章，努力开创乐山旅游发展新篇章。 2017年入选第四届四川省文明城市。 ",
              "编号": "SUB000142298"
            },
            "label": "乐山市"
          },
          {
            "id": "12515",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "峨眉山市",
              "区县代码": "511181000000",
              "区县id": "5cd1439489730d2d50fe5a8d"
            },
            "label": "峨眉山市"
          },
          {
            "id": "12506",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "沙湾区",
              "区县代码": "511111000000",
              "区县id": "5cd1439489730d2d50fe5a84"
            },
            "label": "沙湾区"
          },
          {
            "id": "12510",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "井研县",
              "区县代码": "511124000000",
              "区县id": "5cd1439489730d2d50fe5a88"
            },
            "label": "井研县"
          },
          {
            "id": "12507",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "五通桥区",
              "区县代码": "511112000000",
              "区县id": "5cd1439489730d2d50fe5a85"
            },
            "label": "五通桥区"
          },
          {
            "id": "12505",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "市中区",
              "区县代码": "511102000000",
              "区县id": "5cd1439489730d2d50fe5a83"
            },
            "label": "市中区"
          },
          {
            "id": "12514",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "马边彝族自治县",
              "区县代码": "511133000000",
              "区县id": "5cd1439489730d2d50fe5a8c"
            },
            "label": "马边彝族自治县"
          },
          {
            "id": "12508",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "金口河区",
              "区县代码": "511113000000",
              "区县id": "5cd1439489730d2d50fe5a86"
            },
            "label": "金口河区"
          },
          {
            "id": "12504",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "市辖区",
              "区县代码": "511101000000",
              "区县id": "5cd1439489730d2d50fe5a82"
            },
            "label": "市辖区"
          },
          {
            "id": "12513",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "峨边彝族自治县",
              "区县代码": "511132000000",
              "区县id": "5cd1439489730d2d50fe5a8b"
            },
            "label": "峨边彝族自治县"
          },
          {
            "id": "12512",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "沐川县",
              "区县代码": "511129000000",
              "区县id": "5cd1439489730d2d50fe5a8a"
            },
            "label": "沐川县"
          },
          {
            "id": "12511",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "夹江县",
              "区县代码": "511126000000",
              "区县id": "5cd1439489730d2d50fe5a89"
            },
            "label": "夹江县"
          },
          {
            "id": "12509",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "犍为县",
              "区县代码": "511123000000",
              "区县id": "5cd1439489730d2d50fe5a87"
            },
            "label": "犍为县"
          },
          {
            "id": "9703",
            "labels": [
              "省"
            ],
            "properties": {
              "省份代码": "51",
              "省份名称": "四川省",
              "省份id": "5cd13b4189730d12d4abdc72"
            },
            "label": "四川省"
          },
          {
            "id": "987424",
            "labels": [
              "人员"
            ],
            "properties": {
              "姓名": "杨译舒",
              "研究领域": "暴雨强度公式,皮尔逊-Ⅲ型分布曲线,耿贝尔分布曲线,指数分布曲线,暴雨参数,四川乐山市",
              "人员id": "R14200"
            },
            "label": "杨译舒"
          },
          {
            "id": "1384348",
            "labels": [
              "文献"
            ],
            "properties": {
              "文献作者": "杨良清",
              "文献类型": "论文",
              "文献摘要": "加快发展水利,着力改善民生,对进一步增强经济社会发展的基础保障能力意义十分重大。作为地处\"三江\"流域的乐山市,存在水资源分布不均、渠系配套较低、骨干水利工程不足、农村人口饮水不安全等困难和问题,成为制约全市水利发展的\"瓶颈\"。必须坚持科学发展观,加快水利工程建设,加大对水利的投入力度,推进依法治水和科技兴水,强化水利管理和改革,进一步优化政策环境,加强对水利工作的领导,才能促进传统水利向现代水利的转变,实现构建和谐水利的目标。",
              "发表期刊": "四川水利",
              "文献id": "P233457",
              "发表日期": "2008年05期",
              "文献名称": "乐山市发展水利改善民生的策略",
              "文献关键词": "发展水利,改善民生,策略,乐山市"
            },
            "label": "乐山市发展水利改善民生的策略"
          },
          {
            "id": "1124638",
            "labels": [
              "文献"
            ],
            "properties": {
              "文献作者": "杨译舒,叶兴成,王飞,朱程亮,游志康,欧淑芳,刘俊",
              "文献类型": "论文",
              "文献摘要": "利用四川省乐山市气象站1981-2015年短历时暴雨雨量资料,采用年最大值法选样推求暴雨公式,分析皮尔逊-Ⅲ型分布曲线、耿贝尔分布曲线、指数分布曲线三种频率分布曲线模型与原始暴雨资料的适配性,并对不同频率分布的暴雨参数进行分析。结果表明三种频率分布曲线导出的暴雨公式在计算重现期为2-20年时,仅耿贝尔分布曲线符合精度要求。将新编的暴雨公式与现行暴雨公式、周边城市暴雨公式及《中国暴雨统计参数图集》进行了对比分析,新一代乐山市暴雨公式参数合理性得以验证,为乐山市排水系统的优化设计、排水管网建设与改造提供了新的理论参考。",
              "发表期刊": "灾害学",
              "文献id": "P19291",
              "发表日期": "2017年04期",
              "文献名称": "基于不同频率分布的乐山市暴雨参数分析",
              "文献关键词": "暴雨强度公式,皮尔逊-Ⅲ型分布曲线,耿贝尔分布曲线,指数分布曲线,暴雨参数,四川乐山市"
            },
            "label": "基于不同频率分布的乐山市暴雨参数分析"
          },
          {
            "id": "66673",
            "labels": [
              "水利术语"
            ],
            "properties": {
              "名称拼音": "shuǐ lì gōng chéng",
              "英文名称": "",
              "是否为正式主题词": "1.0",
              "术语来源": "互动百科",
              "名称": "水利工程",
              "术语释义": "水利工程是用于控制和调配自然界的地表水和地下水，达到除害兴利目的而修建的工程。也称为水工程。水是人类生产和生活必不可少的宝贵资源，但其自然存在的状态并不完全符合人类的需要。只有修建水利工程，才能控制水流，防止洪涝灾害，并进行水量的调节和分配，以满足人民生活和生产对水资源的需要。水利工程需要修建坝、堤、溢洪道、水闸、进水口、渠道、渡漕、筏道、鱼道等不同类型的水工建筑物，以实现其目标。",
              "释义": "水利工程是用于控制和调配自然界的地表水和地下水，达到除害兴利目的而修建的工程。也称为水工程。水是人类生产和生活必不可少的宝贵资源，但其自然存在的状态并不完全符合人类的需要。只有修建水利工程，才能控制水流，防止洪涝灾害，并进行水量的调节和分配，以满足人民生活和生产对水资源的需要。水利工程需要修建坝、堤、溢洪道、水闸、进水口、渠道、渡漕、筏道、鱼道等不同类型的水工建筑物，以实现其目标。",
              "编号": "110000012",
              "名称拼音首字母": "SLGC"
            },
            "label": "水利工程"
          },
          {
            "id": "901317",
            "labels": [
              "水利术语"
            ],
            "properties": {
              "名称": "农村水利",
              "编号": "SUB000017352"
            },
            "label": "农村水利"
          },
          {
            "id": "12515",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "峨眉山市",
              "区县代码": "511181000000",
              "区县id": "5cd1439489730d2d50fe5a8d"
            },
            "label": "峨眉山市"
          },
          {
            "id": "12506",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "沙湾区",
              "区县代码": "511111000000",
              "区县id": "5cd1439489730d2d50fe5a84"
            },
            "label": "沙湾区"
          },
          {
            "id": "12510",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "井研县",
              "区县代码": "511124000000",
              "区县id": "5cd1439489730d2d50fe5a88"
            },
            "label": "井研县"
          },
          {
            "id": "12507",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "五通桥区",
              "区县代码": "511112000000",
              "区县id": "5cd1439489730d2d50fe5a85"
            },
            "label": "五通桥区"
          },
          {
            "id": "12505",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "市中区",
              "区县代码": "511102000000",
              "区县id": "5cd1439489730d2d50fe5a83"
            },
            "label": "市中区"
          },
          {
            "id": "12514",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "马边彝族自治县",
              "区县代码": "511133000000",
              "区县id": "5cd1439489730d2d50fe5a8c"
            },
            "label": "马边彝族自治县"
          },
          {
            "id": "12508",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "金口河区",
              "区县代码": "511113000000",
              "区县id": "5cd1439489730d2d50fe5a86"
            },
            "label": "金口河区"
          },
          {
            "id": "12504",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "市辖区",
              "区县代码": "511101000000",
              "区县id": "5cd1439489730d2d50fe5a82"
            },
            "label": "市辖区"
          },
          {
            "id": "12513",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "峨边彝族自治县",
              "区县代码": "511132000000",
              "区县id": "5cd1439489730d2d50fe5a8b"
            },
            "label": "峨边彝族自治县"
          },
          {
            "id": "12512",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "沐川县",
              "区县代码": "511129000000",
              "区县id": "5cd1439489730d2d50fe5a8a"
            },
            "label": "沐川县"
          },
          {
            "id": "12511",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "夹江县",
              "区县代码": "511126000000",
              "区县id": "5cd1439489730d2d50fe5a89"
            },
            "label": "夹江县"
          },
          {
            "id": "12509",
            "labels": [
              "区县"
            ],
            "properties": {
              "区县名称": "犍为县",
              "区县代码": "511123000000",
              "区县id": "5cd1439489730d2d50fe5a87"
            },
            "label": "犍为县"
          },
          {
            "id": "9703",
            "labels": [
              "省"
            ],
            "properties": {
              "省份代码": "51",
              "省份名称": "四川省",
              "省份id": "5cd13b4189730d12d4abdc72"
            },
            "label": "四川省"
          },
          {
            "id": "987424",
            "labels": [
              "人员"
            ],
            "properties": {
              "姓名": "杨译舒",
              "研究领域": "暴雨强度公式,皮尔逊-Ⅲ型分布曲线,耿贝尔分布曲线,指数分布曲线,暴雨参数,四川乐山市",
              "人员id": "R14200"
            },
            "label": "杨译舒"
          },
          {
            "id": "1384348",
            "labels": [
              "文献"
            ],
            "properties": {
              "文献作者": "杨良清",
              "文献类型": "论文",
              "文献摘要": "加快发展水利,着力改善民生,对进一步增强经济社会发展的基础保障能力意义十分重大。作为地处\"三江\"流域的乐山市,存在水资源分布不均、渠系配套较低、骨干水利工程不足、农村人口饮水不安全等困难和问题,成为制约全市水利发展的\"瓶颈\"。必须坚持科学发展观,加快水利工程建设,加大对水利的投入力度,推进依法治水和科技兴水,强化水利管理和改革,进一步优化政策环境,加强对水利工作的领导,才能促进传统水利向现代水利的转变,实现构建和谐水利的目标。",
              "发表期刊": "四川水利",
              "文献id": "P233457",
              "发表日期": "2008年05期",
              "文献名称": "乐山市发展水利改善民生的策略",
              "文献关键词": "发展水利,改善民生,策略,乐山市"
            },
            "label": "乐山市发展水利改善民生的策略"
          },
          {
            "id": "1124638",
            "labels": [
              "文献"
            ],
            "properties": {
              "文献作者": "杨译舒,叶兴成,王飞,朱程亮,游志康,欧淑芳,刘俊",
              "文献类型": "论文",
              "文献摘要": "利用四川省乐山市气象站1981-2015年短历时暴雨雨量资料,采用年最大值法选样推求暴雨公式,分析皮尔逊-Ⅲ型分布曲线、耿贝尔分布曲线、指数分布曲线三种频率分布曲线模型与原始暴雨资料的适配性,并对不同频率分布的暴雨参数进行分析。结果表明三种频率分布曲线导出的暴雨公式在计算重现期为2-20年时,仅耿贝尔分布曲线符合精度要求。将新编的暴雨公式与现行暴雨公式、周边城市暴雨公式及《中国暴雨统计参数图集》进行了对比分析,新一代乐山市暴雨公式参数合理性得以验证,为乐山市排水系统的优化设计、排水管网建设与改造提供了新的理论参考。",
              "发表期刊": "灾害学",
              "文献id": "P19291",
              "发表日期": "2017年04期",
              "文献名称": "基于不同频率分布的乐山市暴雨参数分析",
              "文献关键词": "暴雨强度公式,皮尔逊-Ⅲ型分布曲线,耿贝尔分布曲线,指数分布曲线,暴雨参数,四川乐山市"
            },
            "label": "基于不同频率分布的乐山市暴雨参数分析"
          },
          {
            "id": "66673",
            "labels": [
              "水利术语"
            ],
            "properties": {
              "名称拼音": "shuǐ lì gōng chéng",
              "英文名称": "",
              "是否为正式主题词": "1.0",
              "术语来源": "互动百科",
              "名称": "水利工程",
              "术语释义": "水利工程是用于控制和调配自然界的地表水和地下水，达到除害兴利目的而修建的工程。也称为水工程。水是人类生产和生活必不可少的宝贵资源，但其自然存在的状态并不完全符合人类的需要。只有修建水利工程，才能控制水流，防止洪涝灾害，并进行水量的调节和分配，以满足人民生活和生产对水资源的需要。水利工程需要修建坝、堤、溢洪道、水闸、进水口、渠道、渡漕、筏道、鱼道等不同类型的水工建筑物，以实现其目标。",
              "释义": "水利工程是用于控制和调配自然界的地表水和地下水，达到除害兴利目的而修建的工程。也称为水工程。水是人类生产和生活必不可少的宝贵资源，但其自然存在的状态并不完全符合人类的需要。只有修建水利工程，才能控制水流，防止洪涝灾害，并进行水量的调节和分配，以满足人民生活和生产对水资源的需要。水利工程需要修建坝、堤、溢洪道、水闸、进水口、渠道、渡漕、筏道、鱼道等不同类型的水工建筑物，以实现其目标。",
              "编号": "110000012",
              "名称拼音首字母": "SLGC"
            },
            "label": "水利工程"
          },
          {
            "id": "901317",
            "labels": [
              "水利术语"
            ],
            "properties": {
              "名称": "农村水利",
              "编号": "SUB000017352"
            },
            "label": "农村水利"
          }
        ],
        // 边集
        edges: [
          {
            "id": "12434",
            "label": "隶属于",
            "source": "12515",
            "target": "9953"
          },
          {
            "id": "12425",
            "label": "隶属于",
            "source": "12506",
            "target": "9953"
          },
          {
            "id": "12429",
            "label": "隶属于",
            "source": "12510",
            "target": "9953"
          },
          {
            "id": "12426",
            "label": "隶属于",
            "source": "12507",
            "target": "9953"
          },
          {
            "id": "12424",
            "label": "隶属于",
            "source": "12505",
            "target": "9953"
          },
          {
            "id": "12433",
            "label": "隶属于",
            "source": "12514",
            "target": "9953"
          },
          {
            "id": "12427",
            "label": "隶属于",
            "source": "12508",
            "target": "9953"
          },
          {
            "id": "12423",
            "label": "隶属于",
            "source": "12504",
            "target": "9953"
          },
          {
            "id": "12432",
            "label": "隶属于",
            "source": "12513",
            "target": "9953"
          },
          {
            "id": "12431",
            "label": "隶属于",
            "source": "12512",
            "target": "9953"
          },
          {
            "id": "12430",
            "label": "隶属于",
            "source": "12511",
            "target": "9953"
          },
          {
            "id": "12428",
            "label": "隶属于",
            "source": "12509",
            "target": "9953"
          },
          {
            "id": "9867",
            "label": "隶属于",
            "source": "9953",
            "target": "9703"
          },
          {
            "id": "2955857",
            "label": "研究主题",
            "source": "987424",
            "target": "941293"
          },
          {
            "id": "2540856",
            "label": "研究主题",
            "source": "1384348",
            "target": "941293"
          },
          {
            "id": "1680348",
            "label": "研究主题",
            "source": "1124638",
            "target": "941293"
          },
          {
            "id": "1033317",
            "label": "所属类目",
            "source": "941293",
            "target": "66673"
          },
          {
            "id": "815958",
            "label": "所属类目",
            "source": "941293",
            "target": "901317"
          },
          {
            "id": "12434",
            "label": "隶属于",
            "source": "12515",
            "target": "9953"
          },
          {
            "id": "12425",
            "label": "隶属于",
            "source": "12506",
            "target": "9953"
          },
          {
            "id": "12429",
            "label": "隶属于",
            "source": "12510",
            "target": "9953"
          },
          {
            "id": "12426",
            "label": "隶属于",
            "source": "12507",
            "target": "9953"
          },
          {
            "id": "12424",
            "label": "隶属于",
            "source": "12505",
            "target": "9953"
          },
          {
            "id": "12433",
            "label": "隶属于",
            "source": "12514",
            "target": "9953"
          },
          {
            "id": "12427",
            "label": "隶属于",
            "source": "12508",
            "target": "9953"
          },
          {
            "id": "12423",
            "label": "隶属于",
            "source": "12504",
            "target": "9953"
          },
          {
            "id": "12432",
            "label": "隶属于",
            "source": "12513",
            "target": "9953"
          },
          {
            "id": "12431",
            "label": "隶属于",
            "source": "12512",
            "target": "9953"
          },
          {
            "id": "12430",
            "label": "隶属于",
            "source": "12511",
            "target": "9953"
          },
          {
            "id": "12428",
            "label": "隶属于",
            "source": "12509",
            "target": "9953"
          },
          {
            "id": "9867",
            "label": "隶属于",
            "source": "9953",
            "target": "9703"
          },
          {
            "id": "2955857",
            "label": "研究主题",
            "source": "987424",
            "target": "941293"
          },
          {
            "id": "2540856",
            "label": "研究主题",
            "source": "1384348",
            "target": "941293"
          },
          {
            "id": "1680348",
            "label": "研究主题",
            "source": "1124638",
            "target": "941293"
          },
          {
            "id": "1033317",
            "label": "所属类目",
            "source": "941293",
            "target": "66673"
          },
          {
            "id": "815958",
            "label": "所属类目",
            "source": "941293",
            "target": "901317"
          }
        ],
      };
      const minimap = new G6.Minimap({
        size: [150, 100],
      });
      const graph = new G6.Graph({
        container: 'mountNode', // String | HTMLElement，必须，在 Step 1 中创建的容器 id 或容器本身
        width: 1500, // Number，必须，图的宽度
        height: 700, // Number，必须，图的高度
        layout: {
          // Object，可选，布局的方法及其配置项，默认为 random 布局。
          type: 'force', // 指定为力导向布局
          preventOverlap: true, // 防止节点重叠
          linkDistance: 200, // 指定边距离为100
          nodeSize: 80        // 节点大小，用于算法中防止节点重叠时的碰撞检测。由于已经在上一节的元素配置中设置了每个节点的 size 属性，则不需要在此设置 nodeSize。
        },
        modes: {
          default: ['drag-canvas', 'zoom-canvas', 'drag-node'], // 允许拖拽画布、放缩画布、拖拽节点
        },
        plugins: [minimap],
        animate: true, // Boolean，可选，全局变化时否使用动画过渡
        defaultNode: {
          size: 50,
          labelCfg: {
            style: {},
          },
        },
        defaultEdge: {
          type: 'quadratic', // 指定边的形状为二阶贝塞尔曲线
          style: {
            stroke: '#e2e2e2',
          },
        },
      });
      graph.data(data1); // 读取 Step 2 中的数据源到图上
      graph.render(); // 渲染图

      // graph.on('node:dragstart', function (e) {
      //   graph.layout();
      //   this.refreshDragedNodePosition(e);
      // });
      graph.on('node:drag', function (e) {
        const forceLayout = graph.get('layoutController').layoutMethods[0];
        forceLayout.execute();
        // this.refreshDragedNodePosition(e);
      });
      // graph.on('node:dragend', function (e) {
      //   e.item.get('model').fx = null;
      //   e.item.get('model').fy = null;
      // });
      this.currentGraph = graph
    },

    refreshDragedNodePosition(e) {
      const model = e.item.get('model');
      model.fx = e.x;
      model.fy = e.y;
    }
  },

  mounted() {
    this.initGraph()
  }
}
</script>

<style scoped>

.graph-box {
  width: 1500px;
  height: 700px;
  border: 1px solid rgba(16, 26, 61, 0.37);
}

.title-box {
  font-size: 48px;
  text-align: center;
  padding: 40px;
}

.main-box {
  padding: 4px 0 0 0;
}

.search-box {
  display: flex;
  width: 600px;
  margin-bottom: 40px;
}

.input-box {
  font-size: 16px;
  width: 500px;
  height: 40px;
  line-height: inherit;
  outline: 0;
  background-color: #f5f6f7;
  color: gray;
  border: 1px solid #e8e8ed;
  box-sizing: border-box;
  border-radius: 16px 0 0 16px;
  text-indent: 32px;

}

input:focus {
  border: 1px solid #e8e8ed;

}

.search-button-box {
  width: 100px;
  height: 40px;
  outline: none;
  border: 0 none;
  border-radius: 0 16px 16px 0;
  font-size: 16px;
  line-height: 32px;
  cursor: pointer;
  background-color: #66ccff;
  text-align: left;
  color: white;
}

.icon-fire {
  position: absolute;
  width: 16px;
  height: 16px;
  margin-right: 3px;
  left: 12px;
  top: 8px;
  z-index: 99;
}

.icon-search {
  width: 24px;
  height: 24px;
  vertical-align: middle;
  position: relative;
  top: 5px;
  margin-left: 10px;
  margin-right: 4px;
}

.search-area-box {
  display: flex;
  justify-content: center;
  align-items: center;
  margin: 10px;
}

.graph-area {
  display: flex;
  justify-content: center;
  align-items: center;
}

</style>
